# 원, 타원, 호 그리기

import cv2

img = cv2.imread('../img/blank_500.jpg')

# 원점(150,150) , 반지름 100
cv2.circle(img, (150,150), 100, (255,0,0))
# 원점(300,150), 반지름 70
cv2.circle(img, (300,150),70,(0,255,0),5)
# 원점(400,150), 반지름 50, 채우기
cv2.circle(img, (400,150), 50, (0,0,255), -1)
# 원점(50,300), 반지름 50, 회전 0, 0도 부터 360도 그리기
cv2.ellipse(img, (50,300), (50,50),0,0,360, (0,0,255))
# 원점(150,300), 아래 반원 그리기
cv2.ellipse(img, (150,300), (50,50), 0,0,180, (255,0,0))
# 원점(200,300), 위 반원 그리기
cv2.ellipse(img, (200,300),(50,50),0, 181, 360, (0,0,255))

# 원점 (325,300), 반지름(75,50) 납작한 타원 그리기
cv2.ellipse(img, (325,300),(75,50),0,0,360,(0,255,0))
# 원점(450,300), 반지름(50,75) 홀쭉한 타원 그리기
cv2.ellipse(img, (450,300), (50,75), 45, 0, 360, (0,0,0))

# 원점(350,425), 홀쭉한 타원 45도 회전 후 아래 반원 그리기
cv2.ellipse(img, (350,425), (50,75),45,0,180, (0,0,255))
# 원점(400,425), 홀쭉한 타원 45도 회전 후 아래 반원 그리기
cv2.ellipse(img, (400,425), (50,75),45,181,360, (255,0,0))

cv2.imwrite('jpg/Draw_circle.jpg',img)

cv2.imshow('circle' ,img)
cv2.waitKey()
cv2.destoryAllWindows()